examples/laminar_pipe/constant/polyMesh/boundary
FoamFile
{
    version 2.0;
    format ascii;
    class polyBoundaryMesh;
    location "constant/polyMesh";
    object boundary;
}

3
(
    inlet
    {
        type patch;
        nFaces 1;
        startFace 3;
    }
    outlet
    {
        type patch;
        nFaces 1;
        startFace 4;
    }
    wall
    {
        type wall;
        nFaces 16;
        startFace 5;
    }
)
