examples/laminar_pipe/constant/pipeBenchmark
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object pipeBenchmark;
}

description "Laminar circular pipe reference for the coarse laminar_pipe case";

geometry
{
    length [0 1 0 0 0 0 0] 1.0;
    diameter [0 1 0 0 0 0 0] 0.02;
}

water
{
    referenceTemperature [0 0 0 1 0 0 0] 293.15;
    rho [1 -3 0 0 0 0 0] 998.2;
    mu [1 -1 -1 0 0 0 0] 1.002e-3;
    k [1 1 -3 -1 0 0 0] 0.598;
}

flowReference
{
    meanVelocity [0 1 -1 0 0 0 0] 0.02;
    reynolds [0 0 0 0 0 0 0] 398.48;
    pressureLossModel HagenPoiseuille;
    expectedDeltaP [1 -1 -2 0 0 0 0] 1.6032;
    minorLosses off;
}

heatReference
{
    enabled yes;
    wallTemperature [0 0 0 1 0 0 0] 333.15;
    nusseltConstantWallTemperature [0 0 0 0 0 0 0] 3.66;
    expectedH [1 0 -3 -1 0 0 0] 109.434;
}

variants
{
    noLosses
    {
        wallFriction off;
        heatTransfer off;
    }

    hagenPoiseuille
    {
        wallFriction on;
        minorLosses off;
        heatTransfer off;
    }

    constantWallTemperature
    {
        wallFriction on;
        minorLosses off;
        heatTransfer fixedWallTemperature;
    }
}
