examples/laminar_pipe/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object transportProperties;
}

transportModel Newtonian;

rho [1 -3 0 0 0 0 0] 998.2;
mu [1 -1 -1 0 0 0 0] 1.002e-3;
nu [0 2 -1 0 0 0 0] 1.0038e-6;

Cp [0 2 -2 -1 0 0 0] 4182;
k [1 1 -3 -1 0 0 0] 0.598;
Pr [0 0 0 0 0 0 0] 7.01;
