examples/laminar_pipe/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location "0";
    object U;
}

dimensions [0 1 -1 0 0 0 0];

// Mean axial velocity used by the analytical reference.
internalField uniform (0.02 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (0.02 0 0);
    }
    outlet
    {
        type zeroGradient;
    }
    wall
    {
        type noSlip;
    }
}
