examples/laminar_pipe/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p;
}

dimensions [1 -1 -2 0 0 0 0];

// Static pressure in Pa. Values follow the Hagen-Poiseuille reference
// linearly from inlet to outlet for preflight-only initialization.
internalField nonuniform List<scalar>
4
(
    1.6032
    1.2024
    0.8016
    0.4008
);

boundaryField
{
    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type fixedValue;
        value uniform 0;
    }
    wall
    {
        type zeroGradient;
    }
}
