examples/laminar_pipe/0/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object T;
}

dimensions [0 0 0 1 0 0 0];

internalField uniform 293.15;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 293.15;
    }
    outlet
    {
        type zeroGradient;
    }
    wall
    {
        type fixedValue;
        value uniform 333.15;
    }
}
