examples/laminar_pipe/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSolution;
}

solvers
{
    p { solver PCG; tolerance 1e-10; relTol 0; }
    U { solver smoothSolver; tolerance 1e-10; relTol 0; }
    T { solver smoothSolver; tolerance 1e-10; relTol 0; }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}
